### DateTime

In [1]:
from datetime import datetime

In [2]:
myyear = 2024
mymonth = 9
myday = 10
myhour = 20
myminute = 29
myseconds = 30

In [3]:
mydate = datetime(myyear,mymonth,myday,myhour,myminute,myseconds)

In [4]:
type(mydate)

datetime.datetime

In [5]:
mydate.day

10

In [6]:
mydate.hour

20

In [7]:
import pandas as pd

In [8]:
myser = pd.Series(['Nov 4 2020', '2020-01-01',None])
myser

0    Nov 4 2020
1    2020-01-01
2          None
dtype: object

In [11]:
myser[1]

'2020-01-01'

In [12]:
myser_dt = pd.to_datetime(myser,format='mixed')
myser_dt[0]

Timestamp('2020-11-04 00:00:00')

In [13]:
sample_date = '10-12-2024'
dt = pd.to_datetime(sample_date)

In [14]:
dt.day

12

In [15]:
dt.month

10

In [16]:
dt1 = pd.to_datetime(sample_date,dayfirst=True)

In [17]:
dt1.day

10

In [18]:
dt1.month

12

In [19]:
#custom time string formatting

style_date = '31**Dec&&2024'

pd.to_datetime(style_date,format='%d**%b&&%Y')

Timestamp('2024-12-31 00:00:00')

### Data

In [21]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')
sales.head(3)

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597

In [22]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [24]:
sales.iloc[0]['DATE']

'1992-01-01'

In [26]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [27]:
sales.iloc[0]['DATE']

Timestamp('1992-01-01 00:00:00')

In [28]:
type(sales.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

In [29]:
sales1 = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])
sales1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [30]:
sales1 = sales1.set_index('DATE')
sales1.head(2)

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541

In [36]:
sales1.resample(rule = 'Q').mean()

            MRTSSM4453USN
DATE
1992-03-31    1549.000000
1992-06-30    1757.333333
1992-09-30    1848.000000
1992-12-31    2074.666667
1993-03-31    1607.000000
...                   ...
2019-06-30    4900.000000
2019-09-30    5065.000000
2019-12-31    5618.333333
2020-03-31    4827.666667
2020-06-30    5207.000000

[114 rows x 1 columns]

### .dt method

In [38]:
sales['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int32

In [39]:
sales['DATE'].dt.is_leap_year

0       True
1       True
2       True
3       True
4       True
       ...
335    False
336     True
337     True
338     True
339     True
Name: DATE, Length: 340, dtype: bool

In [43]:
#help(sales['DATE'].dt)

In [42]:
sales['DATE'].dt.dayofyear

0        1
1       32
2       61
3       92
4      122
      ...
335    335
336      1
337     32
338     61
339     92
Name: DATE, Length: 340, dtype: int32